espressif/esp-idf/components/soc/esp32h4/register/soc/touch_aon_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** TOUCH_AON_APPROACH_WORK_MEAS_NUM_REG register
 *  need_des
 */
#define TOUCH_AON_APPROACH_WORK_MEAS_NUM_REG (DR_REG_TOUCH_AON_BASE + 0x0)
/** TOUCH_AON_TOUCH_APPROACH_MEAS_NUM2 : R/W; bitpos: [9:0]; default: 100;
 *  need_des
 */
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM2    0x000003FFU
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM2_M  (TOUCH_AON_TOUCH_APPROACH_MEAS_NUM2_V << TOUCH_AON_TOUCH_APPROACH_MEAS_NUM2_S)
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM2_V  0x000003FFU
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM2_S  0
/** TOUCH_AON_TOUCH_APPROACH_MEAS_NUM1 : R/W; bitpos: [19:10]; default: 100;
 *  need_des
 */
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM1    0x000003FFU
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM1_M  (TOUCH_AON_TOUCH_APPROACH_MEAS_NUM1_V << TOUCH_AON_TOUCH_APPROACH_MEAS_NUM1_S)
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM1_V  0x000003FFU
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM1_S  10
/** TOUCH_AON_TOUCH_APPROACH_MEAS_NUM0 : R/W; bitpos: [29:20]; default: 100;
 *  need_des
 */
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM0    0x000003FFU
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM0_M  (TOUCH_AON_TOUCH_APPROACH_MEAS_NUM0_V << TOUCH_AON_TOUCH_APPROACH_MEAS_NUM0_S)
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM0_V  0x000003FFU
#define TOUCH_AON_TOUCH_APPROACH_MEAS_NUM0_S  20

/** TOUCH_AON_SCAN_CTRL1_REG register
 *  need_des
 */
#define TOUCH_AON_SCAN_CTRL1_REG (DR_REG_TOUCH_AON_BASE + 0x4)
/** TOUCH_AON_TOUCH_SHIELD_PAD_EN : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SHIELD_PAD_EN    (BIT(0))
#define TOUCH_AON_TOUCH_SHIELD_PAD_EN_M  (TOUCH_AON_TOUCH_SHIELD_PAD_EN_V << TOUCH_AON_TOUCH_SHIELD_PAD_EN_S)
#define TOUCH_AON_TOUCH_SHIELD_PAD_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_SHIELD_PAD_EN_S  0
/** TOUCH_AON_TOUCH_INACTIVE_CONNECTION : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_INACTIVE_CONNECTION    (BIT(1))
#define TOUCH_AON_TOUCH_INACTIVE_CONNECTION_M  (TOUCH_AON_TOUCH_INACTIVE_CONNECTION_V << TOUCH_AON_TOUCH_INACTIVE_CONNECTION_S)
#define TOUCH_AON_TOUCH_INACTIVE_CONNECTION_V  0x00000001U
#define TOUCH_AON_TOUCH_INACTIVE_CONNECTION_S  1
/** TOUCH_AON_TOUCH_SCAN_PAD_MAP : R/W; bitpos: [16:2]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SCAN_PAD_MAP    0x00007FFFU
#define TOUCH_AON_TOUCH_SCAN_PAD_MAP_M  (TOUCH_AON_TOUCH_SCAN_PAD_MAP_V << TOUCH_AON_TOUCH_SCAN_PAD_MAP_S)
#define TOUCH_AON_TOUCH_SCAN_PAD_MAP_V  0x00007FFFU
#define TOUCH_AON_TOUCH_SCAN_PAD_MAP_S  2
/** TOUCH_AON_TOUCH_XPD_WAIT : R/W; bitpos: [31:17]; default: 4;
 *  need_des
 */
#define TOUCH_AON_TOUCH_XPD_WAIT    0x00007FFFU
#define TOUCH_AON_TOUCH_XPD_WAIT_M  (TOUCH_AON_TOUCH_XPD_WAIT_V << TOUCH_AON_TOUCH_XPD_WAIT_S)
#define TOUCH_AON_TOUCH_XPD_WAIT_V  0x00007FFFU
#define TOUCH_AON_TOUCH_XPD_WAIT_S  17

/** TOUCH_AON_SCAN_CTRL2_REG register
 *  need_des
 */
#define TOUCH_AON_SCAN_CTRL2_REG (DR_REG_TOUCH_AON_BASE + 0x8)
/** TOUCH_AON_FREQ_SCAN_CNT_RISE : R/W; bitpos: [1:0]; default: 1;
 *  need_des
 */
#define TOUCH_AON_FREQ_SCAN_CNT_RISE    0x00000003U
#define TOUCH_AON_FREQ_SCAN_CNT_RISE_M  (TOUCH_AON_FREQ_SCAN_CNT_RISE_V << TOUCH_AON_FREQ_SCAN_CNT_RISE_S)
#define TOUCH_AON_FREQ_SCAN_CNT_RISE_V  0x00000003U
#define TOUCH_AON_FREQ_SCAN_CNT_RISE_S  0
/** TOUCH_AON_TOUCH_TIMEOUT_NUM : R/W; bitpos: [21:6]; default: 65535;
 *  need_des
 */
#define TOUCH_AON_TOUCH_TIMEOUT_NUM    0x0000FFFFU
#define TOUCH_AON_TOUCH_TIMEOUT_NUM_M  (TOUCH_AON_TOUCH_TIMEOUT_NUM_V << TOUCH_AON_TOUCH_TIMEOUT_NUM_S)
#define TOUCH_AON_TOUCH_TIMEOUT_NUM_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_TIMEOUT_NUM_S  6
/** TOUCH_AON_TOUCH_TIMEOUT_EN : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_TIMEOUT_EN    (BIT(22))
#define TOUCH_AON_TOUCH_TIMEOUT_EN_M  (TOUCH_AON_TOUCH_TIMEOUT_EN_V << TOUCH_AON_TOUCH_TIMEOUT_EN_S)
#define TOUCH_AON_TOUCH_TIMEOUT_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_TIMEOUT_EN_S  22
/** TOUCH_AON_TOUCH_OUT_RING : R/W; bitpos: [26:23]; default: 15;
 *  need_des
 */
#define TOUCH_AON_TOUCH_OUT_RING    0x0000000FU
#define TOUCH_AON_TOUCH_OUT_RING_M  (TOUCH_AON_TOUCH_OUT_RING_V << TOUCH_AON_TOUCH_OUT_RING_S)
#define TOUCH_AON_TOUCH_OUT_RING_V  0x0000000FU
#define TOUCH_AON_TOUCH_OUT_RING_S  23
/** TOUCH_AON_FREQ_SCAN_EN : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define TOUCH_AON_FREQ_SCAN_EN    (BIT(27))
#define TOUCH_AON_FREQ_SCAN_EN_M  (TOUCH_AON_FREQ_SCAN_EN_V << TOUCH_AON_FREQ_SCAN_EN_S)
#define TOUCH_AON_FREQ_SCAN_EN_V  0x00000001U
#define TOUCH_AON_FREQ_SCAN_EN_S  27
/** TOUCH_AON_FREQ_SCAN_CNT_LIMIT : R/W; bitpos: [29:28]; default: 3;
 *  need_des
 */
#define TOUCH_AON_FREQ_SCAN_CNT_LIMIT    0x00000003U
#define TOUCH_AON_FREQ_SCAN_CNT_LIMIT_M  (TOUCH_AON_FREQ_SCAN_CNT_LIMIT_V << TOUCH_AON_FREQ_SCAN_CNT_LIMIT_S)
#define TOUCH_AON_FREQ_SCAN_CNT_LIMIT_V  0x00000003U
#define TOUCH_AON_FREQ_SCAN_CNT_LIMIT_S  28

/** TOUCH_AON_WORK_REG register
 *  need_des
 */
#define TOUCH_AON_WORK_REG (DR_REG_TOUCH_AON_BASE + 0xc)
/** TOUCH_AON_DIV_NUM2 : R/W; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define TOUCH_AON_DIV_NUM2    0x00000007U
#define TOUCH_AON_DIV_NUM2_M  (TOUCH_AON_DIV_NUM2_V << TOUCH_AON_DIV_NUM2_S)
#define TOUCH_AON_DIV_NUM2_V  0x00000007U
#define TOUCH_AON_DIV_NUM2_S  16
/** TOUCH_AON_DIV_NUM1 : R/W; bitpos: [21:19]; default: 0;
 *  need_des
 */
#define TOUCH_AON_DIV_NUM1    0x00000007U
#define TOUCH_AON_DIV_NUM1_M  (TOUCH_AON_DIV_NUM1_V << TOUCH_AON_DIV_NUM1_S)
#define TOUCH_AON_DIV_NUM1_V  0x00000007U
#define TOUCH_AON_DIV_NUM1_S  19
/** TOUCH_AON_DIV_NUM0 : R/W; bitpos: [24:22]; default: 0;
 *  need_des
 */
#define TOUCH_AON_DIV_NUM0    0x00000007U
#define TOUCH_AON_DIV_NUM0_M  (TOUCH_AON_DIV_NUM0_V << TOUCH_AON_DIV_NUM0_S)
#define TOUCH_AON_DIV_NUM0_V  0x00000007U
#define TOUCH_AON_DIV_NUM0_S  22
/** TOUCH_AON_TOUCH_OUT_SEL : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_OUT_SEL    (BIT(25))
#define TOUCH_AON_TOUCH_OUT_SEL_M  (TOUCH_AON_TOUCH_OUT_SEL_V << TOUCH_AON_TOUCH_OUT_SEL_S)
#define TOUCH_AON_TOUCH_OUT_SEL_V  0x00000001U
#define TOUCH_AON_TOUCH_OUT_SEL_S  25
/** TOUCH_AON_TOUCH_OUT_RESET : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_OUT_RESET    (BIT(26))
#define TOUCH_AON_TOUCH_OUT_RESET_M  (TOUCH_AON_TOUCH_OUT_RESET_V << TOUCH_AON_TOUCH_OUT_RESET_S)
#define TOUCH_AON_TOUCH_OUT_RESET_V  0x00000001U
#define TOUCH_AON_TOUCH_OUT_RESET_S  26
/** TOUCH_AON_TOUCH_OUT_GATE : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_OUT_GATE    (BIT(27))
#define TOUCH_AON_TOUCH_OUT_GATE_M  (TOUCH_AON_TOUCH_OUT_GATE_V << TOUCH_AON_TOUCH_OUT_GATE_S)
#define TOUCH_AON_TOUCH_OUT_GATE_V  0x00000001U
#define TOUCH_AON_TOUCH_OUT_GATE_S  27

/** TOUCH_AON_WORK_MEAS_NUM_REG register
 *  need_des
 */
#define TOUCH_AON_WORK_MEAS_NUM_REG (DR_REG_TOUCH_AON_BASE + 0x10)
/** TOUCH_AON_TOUCH_MEAS_NUM2 : R/W; bitpos: [9:0]; default: 100;
 *  need_des
 */
#define TOUCH_AON_TOUCH_MEAS_NUM2    0x000003FFU
#define TOUCH_AON_TOUCH_MEAS_NUM2_M  (TOUCH_AON_TOUCH_MEAS_NUM2_V << TOUCH_AON_TOUCH_MEAS_NUM2_S)
#define TOUCH_AON_TOUCH_MEAS_NUM2_V  0x000003FFU
#define TOUCH_AON_TOUCH_MEAS_NUM2_S  0
/** TOUCH_AON_TOUCH_MEAS_NUM1 : R/W; bitpos: [19:10]; default: 100;
 *  need_des
 */
#define TOUCH_AON_TOUCH_MEAS_NUM1    0x000003FFU
#define TOUCH_AON_TOUCH_MEAS_NUM1_M  (TOUCH_AON_TOUCH_MEAS_NUM1_V << TOUCH_AON_TOUCH_MEAS_NUM1_S)
#define TOUCH_AON_TOUCH_MEAS_NUM1_V  0x000003FFU
#define TOUCH_AON_TOUCH_MEAS_NUM1_S  10
/** TOUCH_AON_TOUCH_MEAS_NUM0 : R/W; bitpos: [29:20]; default: 100;
 *  need_des
 */
#define TOUCH_AON_TOUCH_MEAS_NUM0    0x000003FFU
#define TOUCH_AON_TOUCH_MEAS_NUM0_M  (TOUCH_AON_TOUCH_MEAS_NUM0_V << TOUCH_AON_TOUCH_MEAS_NUM0_S)
#define TOUCH_AON_TOUCH_MEAS_NUM0_V  0x000003FFU
#define TOUCH_AON_TOUCH_MEAS_NUM0_S  20

