espressif/esp-idf/components/soc/esp32h4/register/soc/touch_aon_reg.h
/** TOUCH_AON_FILTER1_REG register
 *  need_des
 */
#define TOUCH_AON_FILTER1_REG (DR_REG_TOUCH_AON_BASE + 0x14)
/** TOUCH_AON_TOUCH_NN_DISUPDATE_BENCHMARK_EN : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_NN_DISUPDATE_BENCHMARK_EN    (BIT(0))
#define TOUCH_AON_TOUCH_NN_DISUPDATE_BENCHMARK_EN_M  (TOUCH_AON_TOUCH_NN_DISUPDATE_BENCHMARK_EN_V << TOUCH_AON_TOUCH_NN_DISUPDATE_BENCHMARK_EN_S)
#define TOUCH_AON_TOUCH_NN_DISUPDATE_BENCHMARK_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_NN_DISUPDATE_BENCHMARK_EN_S  0
/** TOUCH_AON_TOUCH_HYSTERESIS : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_HYSTERESIS    0x00000003U
#define TOUCH_AON_TOUCH_HYSTERESIS_M  (TOUCH_AON_TOUCH_HYSTERESIS_V << TOUCH_AON_TOUCH_HYSTERESIS_S)
#define TOUCH_AON_TOUCH_HYSTERESIS_V  0x00000003U
#define TOUCH_AON_TOUCH_HYSTERESIS_S  1
/** TOUCH_AON_TOUCH_NN_THRES : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_NN_THRES    0x00000003U
#define TOUCH_AON_TOUCH_NN_THRES_M  (TOUCH_AON_TOUCH_NN_THRES_V << TOUCH_AON_TOUCH_NN_THRES_S)
#define TOUCH_AON_TOUCH_NN_THRES_V  0x00000003U
#define TOUCH_AON_TOUCH_NN_THRES_S  3
/** TOUCH_AON_TOUCH_NOISE_THRES : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_NOISE_THRES    0x00000003U
#define TOUCH_AON_TOUCH_NOISE_THRES_M  (TOUCH_AON_TOUCH_NOISE_THRES_V << TOUCH_AON_TOUCH_NOISE_THRES_S)
#define TOUCH_AON_TOUCH_NOISE_THRES_V  0x00000003U
#define TOUCH_AON_TOUCH_NOISE_THRES_S  5
/** TOUCH_AON_TOUCH_SMOOTH_LVL : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SMOOTH_LVL    0x00000003U
#define TOUCH_AON_TOUCH_SMOOTH_LVL_M  (TOUCH_AON_TOUCH_SMOOTH_LVL_V << TOUCH_AON_TOUCH_SMOOTH_LVL_S)
#define TOUCH_AON_TOUCH_SMOOTH_LVL_V  0x00000003U
#define TOUCH_AON_TOUCH_SMOOTH_LVL_S  7
/** TOUCH_AON_TOUCH_JITTER_STEP : R/W; bitpos: [12:9]; default: 1;
 *  need_des
 */
#define TOUCH_AON_TOUCH_JITTER_STEP    0x0000000FU
#define TOUCH_AON_TOUCH_JITTER_STEP_M  (TOUCH_AON_TOUCH_JITTER_STEP_V << TOUCH_AON_TOUCH_JITTER_STEP_S)
#define TOUCH_AON_TOUCH_JITTER_STEP_V  0x0000000FU
#define TOUCH_AON_TOUCH_JITTER_STEP_S  9
/** TOUCH_AON_TOUCH_FILTER_MODE : R/W; bitpos: [15:13]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FILTER_MODE    0x00000007U
#define TOUCH_AON_TOUCH_FILTER_MODE_M  (TOUCH_AON_TOUCH_FILTER_MODE_V << TOUCH_AON_TOUCH_FILTER_MODE_S)
#define TOUCH_AON_TOUCH_FILTER_MODE_V  0x00000007U
#define TOUCH_AON_TOUCH_FILTER_MODE_S  13
/** TOUCH_AON_TOUCH_FILTER_EN : R/W; bitpos: [16]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FILTER_EN    (BIT(16))
#define TOUCH_AON_TOUCH_FILTER_EN_M  (TOUCH_AON_TOUCH_FILTER_EN_V << TOUCH_AON_TOUCH_FILTER_EN_S)
#define TOUCH_AON_TOUCH_FILTER_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_FILTER_EN_S  16
/** TOUCH_AON_TOUCH_NN_LIMIT : R/W; bitpos: [20:17]; default: 5;
 *  need_des
 */
#define TOUCH_AON_TOUCH_NN_LIMIT    0x0000000FU
#define TOUCH_AON_TOUCH_NN_LIMIT_M  (TOUCH_AON_TOUCH_NN_LIMIT_V << TOUCH_AON_TOUCH_NN_LIMIT_S)
#define TOUCH_AON_TOUCH_NN_LIMIT_V  0x0000000FU
#define TOUCH_AON_TOUCH_NN_LIMIT_S  17
/** TOUCH_AON_TOUCH_APPROACH_LIMIT : R/W; bitpos: [28:21]; default: 80;
 *  need_des
 */
#define TOUCH_AON_TOUCH_APPROACH_LIMIT    0x000000FFU
#define TOUCH_AON_TOUCH_APPROACH_LIMIT_M  (TOUCH_AON_TOUCH_APPROACH_LIMIT_V << TOUCH_AON_TOUCH_APPROACH_LIMIT_S)
#define TOUCH_AON_TOUCH_APPROACH_LIMIT_V  0x000000FFU
#define TOUCH_AON_TOUCH_APPROACH_LIMIT_S  21
/** TOUCH_AON_TOUCH_DEBOUNCE_LIMIT : R/W; bitpos: [31:29]; default: 3;
 *  need_des
 */
#define TOUCH_AON_TOUCH_DEBOUNCE_LIMIT    0x00000007U
#define TOUCH_AON_TOUCH_DEBOUNCE_LIMIT_M  (TOUCH_AON_TOUCH_DEBOUNCE_LIMIT_V << TOUCH_AON_TOUCH_DEBOUNCE_LIMIT_S)
#define TOUCH_AON_TOUCH_DEBOUNCE_LIMIT_V  0x00000007U
#define TOUCH_AON_TOUCH_DEBOUNCE_LIMIT_S  29

/** TOUCH_AON_FILTER2_REG register
 *  need_des
 */
#define TOUCH_AON_FILTER2_REG (DR_REG_TOUCH_AON_BASE + 0x18)
/** TOUCH_AON_TOUCH_OUTEN : R/W; bitpos: [29:15]; default: 16383;
 *  need_des
 */
#define TOUCH_AON_TOUCH_OUTEN    0x00007FFFU
#define TOUCH_AON_TOUCH_OUTEN_M  (TOUCH_AON_TOUCH_OUTEN_V << TOUCH_AON_TOUCH_OUTEN_S)
#define TOUCH_AON_TOUCH_OUTEN_V  0x00007FFFU
#define TOUCH_AON_TOUCH_OUTEN_S  15
/** TOUCH_AON_TOUCH_BYPASS_NOISE_THRES : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_BYPASS_NOISE_THRES    (BIT(30))
#define TOUCH_AON_TOUCH_BYPASS_NOISE_THRES_M  (TOUCH_AON_TOUCH_BYPASS_NOISE_THRES_V << TOUCH_AON_TOUCH_BYPASS_NOISE_THRES_S)
#define TOUCH_AON_TOUCH_BYPASS_NOISE_THRES_V  0x00000001U
#define TOUCH_AON_TOUCH_BYPASS_NOISE_THRES_S  30
/** TOUCH_AON_TOUCH_BYPASS_NN_THRES : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_BYPASS_NN_THRES    (BIT(31))
#define TOUCH_AON_TOUCH_BYPASS_NN_THRES_M  (TOUCH_AON_TOUCH_BYPASS_NN_THRES_V << TOUCH_AON_TOUCH_BYPASS_NN_THRES_S)
#define TOUCH_AON_TOUCH_BYPASS_NN_THRES_V  0x00000001U
#define TOUCH_AON_TOUCH_BYPASS_NN_THRES_S  31

/** TOUCH_AON_FILTER3_REG register
 *  need_des
 */
#define TOUCH_AON_FILTER3_REG (DR_REG_TOUCH_AON_BASE + 0x1c)
/** TOUCH_AON_TOUCH_BENCHMARK_SW : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_BENCHMARK_SW    0x0000FFFFU
#define TOUCH_AON_TOUCH_BENCHMARK_SW_M  (TOUCH_AON_TOUCH_BENCHMARK_SW_V << TOUCH_AON_TOUCH_BENCHMARK_SW_S)
#define TOUCH_AON_TOUCH_BENCHMARK_SW_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_BENCHMARK_SW_S  0
/** TOUCH_AON_TOUCH_UPDATE_BENCHMARK_SW : WT; bitpos: [16]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_SW    (BIT(16))
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_SW_M  (TOUCH_AON_TOUCH_UPDATE_BENCHMARK_SW_V << TOUCH_AON_TOUCH_UPDATE_BENCHMARK_SW_S)
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_SW_V  0x00000001U
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_SW_S  16
/** TOUCH_AON_TOUCH_UPDATE_BENCHMARK_FREQ_SEL : R/W; bitpos: [18:17]; default: 3;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_FREQ_SEL    0x00000003U
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_M  (TOUCH_AON_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_V << TOUCH_AON_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_S)
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_V  0x00000003U
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_S  17
/** TOUCH_AON_TOUCH_UPDATE_BENCHMARK_PAD_SEL : R/W; bitpos: [22:19]; default: 15;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_PAD_SEL    0x0000000FU
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_PAD_SEL_M  (TOUCH_AON_TOUCH_UPDATE_BENCHMARK_PAD_SEL_V << TOUCH_AON_TOUCH_UPDATE_BENCHMARK_PAD_SEL_S)
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_PAD_SEL_V  0x0000000FU
#define TOUCH_AON_TOUCH_UPDATE_BENCHMARK_PAD_SEL_S  19

/** TOUCH_AON_SLP0_REG register
 *  need_des
 */
#define TOUCH_AON_SLP0_REG (DR_REG_TOUCH_AON_BASE + 0x20)
/** TOUCH_AON_TOUCH_SLP_TH0 : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SLP_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_SLP_TH0_M  (TOUCH_AON_TOUCH_SLP_TH0_V << TOUCH_AON_TOUCH_SLP_TH0_S)
#define TOUCH_AON_TOUCH_SLP_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_SLP_TH0_S  0
/** TOUCH_AON_TOUCH_SLP_CHANNEL_CLR : WT; bitpos: [16]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SLP_CHANNEL_CLR    (BIT(16))
#define TOUCH_AON_TOUCH_SLP_CHANNEL_CLR_M  (TOUCH_AON_TOUCH_SLP_CHANNEL_CLR_V << TOUCH_AON_TOUCH_SLP_CHANNEL_CLR_S)
#define TOUCH_AON_TOUCH_SLP_CHANNEL_CLR_V  0x00000001U
#define TOUCH_AON_TOUCH_SLP_CHANNEL_CLR_S  16
/** TOUCH_AON_TOUCH_SLP_PAD : R/W; bitpos: [20:17]; default: 15;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SLP_PAD    0x0000000FU
#define TOUCH_AON_TOUCH_SLP_PAD_M  (TOUCH_AON_TOUCH_SLP_PAD_V << TOUCH_AON_TOUCH_SLP_PAD_S)
#define TOUCH_AON_TOUCH_SLP_PAD_V  0x0000000FU
#define TOUCH_AON_TOUCH_SLP_PAD_S  17

/** TOUCH_AON_SLP1_REG register
 *  need_des
 */
#define TOUCH_AON_SLP1_REG (DR_REG_TOUCH_AON_BASE + 0x24)
/** TOUCH_AON_TOUCH_SLP_TH2 : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SLP_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_SLP_TH2_M  (TOUCH_AON_TOUCH_SLP_TH2_V << TOUCH_AON_TOUCH_SLP_TH2_S)
#define TOUCH_AON_TOUCH_SLP_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_SLP_TH2_S  0
/** TOUCH_AON_TOUCH_SLP_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SLP_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_SLP_TH1_M  (TOUCH_AON_TOUCH_SLP_TH1_V << TOUCH_AON_TOUCH_SLP_TH1_S)
#define TOUCH_AON_TOUCH_SLP_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_SLP_TH1_S  16

