espressif/esp-idf/components/soc/esp32h4/register/soc/touch_aon_reg.h
/** TOUCH_AON_CLR_REG register
 *  need_des
 */
#define TOUCH_AON_CLR_REG (DR_REG_TOUCH_AON_BASE + 0x28)
/** TOUCH_AON_TOUCH_CHANNEL_CLR : WT; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_CHANNEL_CLR    0x00007FFFU
#define TOUCH_AON_TOUCH_CHANNEL_CLR_M  (TOUCH_AON_TOUCH_CHANNEL_CLR_V << TOUCH_AON_TOUCH_CHANNEL_CLR_S)
#define TOUCH_AON_TOUCH_CHANNEL_CLR_V  0x00007FFFU
#define TOUCH_AON_TOUCH_CHANNEL_CLR_S  0
/** TOUCH_AON_TOUCH_STATUS_CLR : WT; bitpos: [15]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_STATUS_CLR    (BIT(15))
#define TOUCH_AON_TOUCH_STATUS_CLR_M  (TOUCH_AON_TOUCH_STATUS_CLR_V << TOUCH_AON_TOUCH_STATUS_CLR_S)
#define TOUCH_AON_TOUCH_STATUS_CLR_V  0x00000001U
#define TOUCH_AON_TOUCH_STATUS_CLR_S  15

/** TOUCH_AON_APPROACH_REG register
 *  need_des
 */
#define TOUCH_AON_APPROACH_REG (DR_REG_TOUCH_AON_BASE + 0x2c)
/** TOUCH_AON_TOUCH_APPROACH_PAD0 : R/W; bitpos: [3:0]; default: 15;
 *  need_des
 */
#define TOUCH_AON_TOUCH_APPROACH_PAD0    0x0000000FU
#define TOUCH_AON_TOUCH_APPROACH_PAD0_M  (TOUCH_AON_TOUCH_APPROACH_PAD0_V << TOUCH_AON_TOUCH_APPROACH_PAD0_S)
#define TOUCH_AON_TOUCH_APPROACH_PAD0_V  0x0000000FU
#define TOUCH_AON_TOUCH_APPROACH_PAD0_S  0
/** TOUCH_AON_TOUCH_APPROACH_PAD1 : R/W; bitpos: [7:4]; default: 15;
 *  need_des
 */
#define TOUCH_AON_TOUCH_APPROACH_PAD1    0x0000000FU
#define TOUCH_AON_TOUCH_APPROACH_PAD1_M  (TOUCH_AON_TOUCH_APPROACH_PAD1_V << TOUCH_AON_TOUCH_APPROACH_PAD1_S)
#define TOUCH_AON_TOUCH_APPROACH_PAD1_V  0x0000000FU
#define TOUCH_AON_TOUCH_APPROACH_PAD1_S  4
/** TOUCH_AON_TOUCH_APPROACH_PAD2 : R/W; bitpos: [11:8]; default: 15;
 *  need_des
 */
#define TOUCH_AON_TOUCH_APPROACH_PAD2    0x0000000FU
#define TOUCH_AON_TOUCH_APPROACH_PAD2_M  (TOUCH_AON_TOUCH_APPROACH_PAD2_V << TOUCH_AON_TOUCH_APPROACH_PAD2_S)
#define TOUCH_AON_TOUCH_APPROACH_PAD2_V  0x0000000FU
#define TOUCH_AON_TOUCH_APPROACH_PAD2_S  8
/** TOUCH_AON_TOUCH_SLP_APPROACH_EN : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_SLP_APPROACH_EN    (BIT(12))
#define TOUCH_AON_TOUCH_SLP_APPROACH_EN_M  (TOUCH_AON_TOUCH_SLP_APPROACH_EN_V << TOUCH_AON_TOUCH_SLP_APPROACH_EN_S)
#define TOUCH_AON_TOUCH_SLP_APPROACH_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_SLP_APPROACH_EN_S  12

/** TOUCH_AON_FREQ0_SCAN_PARA_REG register
 *  need_des
 */
#define TOUCH_AON_FREQ0_SCAN_PARA_REG (DR_REG_TOUCH_AON_BASE + 0x30)
/** TOUCH_AON_TOUCH_FREQ0_DCAP_LPF : R/W; bitpos: [6:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ0_DCAP_LPF    0x0000007FU
#define TOUCH_AON_TOUCH_FREQ0_DCAP_LPF_M  (TOUCH_AON_TOUCH_FREQ0_DCAP_LPF_V << TOUCH_AON_TOUCH_FREQ0_DCAP_LPF_S)
#define TOUCH_AON_TOUCH_FREQ0_DCAP_LPF_V  0x0000007FU
#define TOUCH_AON_TOUCH_FREQ0_DCAP_LPF_S  0
/** TOUCH_AON_TOUCH_FREQ0_DRES_LPF : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ0_DRES_LPF    0x00000003U
#define TOUCH_AON_TOUCH_FREQ0_DRES_LPF_M  (TOUCH_AON_TOUCH_FREQ0_DRES_LPF_V << TOUCH_AON_TOUCH_FREQ0_DRES_LPF_S)
#define TOUCH_AON_TOUCH_FREQ0_DRES_LPF_V  0x00000003U
#define TOUCH_AON_TOUCH_FREQ0_DRES_LPF_S  7
/** TOUCH_AON_TOUCH_FREQ0_DRV_LS : R/W; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ0_DRV_LS    0x0000000FU
#define TOUCH_AON_TOUCH_FREQ0_DRV_LS_M  (TOUCH_AON_TOUCH_FREQ0_DRV_LS_V << TOUCH_AON_TOUCH_FREQ0_DRV_LS_S)
#define TOUCH_AON_TOUCH_FREQ0_DRV_LS_V  0x0000000FU
#define TOUCH_AON_TOUCH_FREQ0_DRV_LS_S  9
/** TOUCH_AON_TOUCH_FREQ0_DRV_HS : R/W; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ0_DRV_HS    0x0000001FU
#define TOUCH_AON_TOUCH_FREQ0_DRV_HS_M  (TOUCH_AON_TOUCH_FREQ0_DRV_HS_V << TOUCH_AON_TOUCH_FREQ0_DRV_HS_S)
#define TOUCH_AON_TOUCH_FREQ0_DRV_HS_V  0x0000001FU
#define TOUCH_AON_TOUCH_FREQ0_DRV_HS_S  13
/** TOUCH_AON_TOUCH_FREQ0_DBIAS : R/W; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ0_DBIAS    0x0000001FU
#define TOUCH_AON_TOUCH_FREQ0_DBIAS_M  (TOUCH_AON_TOUCH_FREQ0_DBIAS_V << TOUCH_AON_TOUCH_FREQ0_DBIAS_S)
#define TOUCH_AON_TOUCH_FREQ0_DBIAS_V  0x0000001FU
#define TOUCH_AON_TOUCH_FREQ0_DBIAS_S  18
/** TOUCH_AON_TOUCH_FREQ0_BUF_SEL_EN : R/W; bitpos: [23]; default: 1;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ0_BUF_SEL_EN    (BIT(23))
#define TOUCH_AON_TOUCH_FREQ0_BUF_SEL_EN_M  (TOUCH_AON_TOUCH_FREQ0_BUF_SEL_EN_V << TOUCH_AON_TOUCH_FREQ0_BUF_SEL_EN_S)
#define TOUCH_AON_TOUCH_FREQ0_BUF_SEL_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_FREQ0_BUF_SEL_EN_S  23

/** TOUCH_AON_FREQ1_SCAN_PARA_REG register
 *  need_des
 */
#define TOUCH_AON_FREQ1_SCAN_PARA_REG (DR_REG_TOUCH_AON_BASE + 0x34)
/** TOUCH_AON_TOUCH_FREQ1_DCAP_LPF : R/W; bitpos: [6:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ1_DCAP_LPF    0x0000007FU
#define TOUCH_AON_TOUCH_FREQ1_DCAP_LPF_M  (TOUCH_AON_TOUCH_FREQ1_DCAP_LPF_V << TOUCH_AON_TOUCH_FREQ1_DCAP_LPF_S)
#define TOUCH_AON_TOUCH_FREQ1_DCAP_LPF_V  0x0000007FU
#define TOUCH_AON_TOUCH_FREQ1_DCAP_LPF_S  0
/** TOUCH_AON_TOUCH_FREQ1_DRES_LPF : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ1_DRES_LPF    0x00000003U
#define TOUCH_AON_TOUCH_FREQ1_DRES_LPF_M  (TOUCH_AON_TOUCH_FREQ1_DRES_LPF_V << TOUCH_AON_TOUCH_FREQ1_DRES_LPF_S)
#define TOUCH_AON_TOUCH_FREQ1_DRES_LPF_V  0x00000003U
#define TOUCH_AON_TOUCH_FREQ1_DRES_LPF_S  7
/** TOUCH_AON_TOUCH_FREQ1_DRV_LS : R/W; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ1_DRV_LS    0x0000000FU
#define TOUCH_AON_TOUCH_FREQ1_DRV_LS_M  (TOUCH_AON_TOUCH_FREQ1_DRV_LS_V << TOUCH_AON_TOUCH_FREQ1_DRV_LS_S)
#define TOUCH_AON_TOUCH_FREQ1_DRV_LS_V  0x0000000FU
#define TOUCH_AON_TOUCH_FREQ1_DRV_LS_S  9
/** TOUCH_AON_TOUCH_FREQ1_DRV_HS : R/W; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ1_DRV_HS    0x0000001FU
#define TOUCH_AON_TOUCH_FREQ1_DRV_HS_M  (TOUCH_AON_TOUCH_FREQ1_DRV_HS_V << TOUCH_AON_TOUCH_FREQ1_DRV_HS_S)
#define TOUCH_AON_TOUCH_FREQ1_DRV_HS_V  0x0000001FU
#define TOUCH_AON_TOUCH_FREQ1_DRV_HS_S  13
/** TOUCH_AON_TOUCH_FREQ1_DBIAS : R/W; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ1_DBIAS    0x0000001FU
#define TOUCH_AON_TOUCH_FREQ1_DBIAS_M  (TOUCH_AON_TOUCH_FREQ1_DBIAS_V << TOUCH_AON_TOUCH_FREQ1_DBIAS_S)
#define TOUCH_AON_TOUCH_FREQ1_DBIAS_V  0x0000001FU
#define TOUCH_AON_TOUCH_FREQ1_DBIAS_S  18
/** TOUCH_AON_TOUCH_FREQ1_BUF_SEL_EN : R/W; bitpos: [23]; default: 1;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ1_BUF_SEL_EN    (BIT(23))
#define TOUCH_AON_TOUCH_FREQ1_BUF_SEL_EN_M  (TOUCH_AON_TOUCH_FREQ1_BUF_SEL_EN_V << TOUCH_AON_TOUCH_FREQ1_BUF_SEL_EN_S)
#define TOUCH_AON_TOUCH_FREQ1_BUF_SEL_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_FREQ1_BUF_SEL_EN_S  23

/** TOUCH_AON_FREQ2_SCAN_PARA_REG register
 *  need_des
 */
#define TOUCH_AON_FREQ2_SCAN_PARA_REG (DR_REG_TOUCH_AON_BASE + 0x38)
/** TOUCH_AON_TOUCH_FREQ2_DCAP_LPF : R/W; bitpos: [6:0]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ2_DCAP_LPF    0x0000007FU
#define TOUCH_AON_TOUCH_FREQ2_DCAP_LPF_M  (TOUCH_AON_TOUCH_FREQ2_DCAP_LPF_V << TOUCH_AON_TOUCH_FREQ2_DCAP_LPF_S)
#define TOUCH_AON_TOUCH_FREQ2_DCAP_LPF_V  0x0000007FU
#define TOUCH_AON_TOUCH_FREQ2_DCAP_LPF_S  0
/** TOUCH_AON_TOUCH_FREQ2_DRES_LPF : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ2_DRES_LPF    0x00000003U
#define TOUCH_AON_TOUCH_FREQ2_DRES_LPF_M  (TOUCH_AON_TOUCH_FREQ2_DRES_LPF_V << TOUCH_AON_TOUCH_FREQ2_DRES_LPF_S)
#define TOUCH_AON_TOUCH_FREQ2_DRES_LPF_V  0x00000003U
#define TOUCH_AON_TOUCH_FREQ2_DRES_LPF_S  7
/** TOUCH_AON_TOUCH_FREQ2_DRV_LS : R/W; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ2_DRV_LS    0x0000000FU
#define TOUCH_AON_TOUCH_FREQ2_DRV_LS_M  (TOUCH_AON_TOUCH_FREQ2_DRV_LS_V << TOUCH_AON_TOUCH_FREQ2_DRV_LS_S)
#define TOUCH_AON_TOUCH_FREQ2_DRV_LS_V  0x0000000FU
#define TOUCH_AON_TOUCH_FREQ2_DRV_LS_S  9
/** TOUCH_AON_TOUCH_FREQ2_DRV_HS : R/W; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ2_DRV_HS    0x0000001FU
#define TOUCH_AON_TOUCH_FREQ2_DRV_HS_M  (TOUCH_AON_TOUCH_FREQ2_DRV_HS_V << TOUCH_AON_TOUCH_FREQ2_DRV_HS_S)
#define TOUCH_AON_TOUCH_FREQ2_DRV_HS_V  0x0000001FU
#define TOUCH_AON_TOUCH_FREQ2_DRV_HS_S  13
/** TOUCH_AON_TOUCH_FREQ2_DBIAS : R/W; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ2_DBIAS    0x0000001FU
#define TOUCH_AON_TOUCH_FREQ2_DBIAS_M  (TOUCH_AON_TOUCH_FREQ2_DBIAS_V << TOUCH_AON_TOUCH_FREQ2_DBIAS_S)
#define TOUCH_AON_TOUCH_FREQ2_DBIAS_V  0x0000001FU
#define TOUCH_AON_TOUCH_FREQ2_DBIAS_S  18
/** TOUCH_AON_TOUCH_FREQ2_BUF_SEL_EN : R/W; bitpos: [23]; default: 1;
 *  need_des
 */
#define TOUCH_AON_TOUCH_FREQ2_BUF_SEL_EN    (BIT(23))
#define TOUCH_AON_TOUCH_FREQ2_BUF_SEL_EN_M  (TOUCH_AON_TOUCH_FREQ2_BUF_SEL_EN_V << TOUCH_AON_TOUCH_FREQ2_BUF_SEL_EN_S)
#define TOUCH_AON_TOUCH_FREQ2_BUF_SEL_EN_V  0x00000001U
#define TOUCH_AON_TOUCH_FREQ2_BUF_SEL_EN_S  23

