espressif/esp-idf/components/soc/esp32h4/register/soc/touch_aon_reg.h
/** TOUCH_AON_PAD8_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD8_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xac)
/** TOUCH_AON_TOUCH_PAD8_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD8_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD8_TH1_M  (TOUCH_AON_TOUCH_PAD8_TH1_V << TOUCH_AON_TOUCH_PAD8_TH1_S)
#define TOUCH_AON_TOUCH_PAD8_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD8_TH1_S  16

/** TOUCH_AON_PAD8_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD8_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xb0)
/** TOUCH_AON_TOUCH_PAD8_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD8_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD8_TH2_M  (TOUCH_AON_TOUCH_PAD8_TH2_V << TOUCH_AON_TOUCH_PAD8_TH2_S)
#define TOUCH_AON_TOUCH_PAD8_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD8_TH2_S  16

/** TOUCH_AON_PAD9_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD9_TH0_REG (DR_REG_TOUCH_AON_BASE + 0xb4)
/** TOUCH_AON_TOUCH_PAD9_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD9_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD9_TH0_M  (TOUCH_AON_TOUCH_PAD9_TH0_V << TOUCH_AON_TOUCH_PAD9_TH0_S)
#define TOUCH_AON_TOUCH_PAD9_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD9_TH0_S  16

/** TOUCH_AON_PAD9_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD9_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xb8)
/** TOUCH_AON_TOUCH_PAD9_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD9_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD9_TH1_M  (TOUCH_AON_TOUCH_PAD9_TH1_V << TOUCH_AON_TOUCH_PAD9_TH1_S)
#define TOUCH_AON_TOUCH_PAD9_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD9_TH1_S  16

/** TOUCH_AON_PAD9_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD9_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xbc)
/** TOUCH_AON_TOUCH_PAD9_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD9_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD9_TH2_M  (TOUCH_AON_TOUCH_PAD9_TH2_V << TOUCH_AON_TOUCH_PAD9_TH2_S)
#define TOUCH_AON_TOUCH_PAD9_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD9_TH2_S  16

/** TOUCH_AON_PAD10_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD10_TH0_REG (DR_REG_TOUCH_AON_BASE + 0xc0)
/** TOUCH_AON_TOUCH_PAD10_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD10_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD10_TH0_M  (TOUCH_AON_TOUCH_PAD10_TH0_V << TOUCH_AON_TOUCH_PAD10_TH0_S)
#define TOUCH_AON_TOUCH_PAD10_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD10_TH0_S  16

/** TOUCH_AON_PAD10_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD10_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xc4)
/** TOUCH_AON_TOUCH_PAD10_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD10_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD10_TH1_M  (TOUCH_AON_TOUCH_PAD10_TH1_V << TOUCH_AON_TOUCH_PAD10_TH1_S)
#define TOUCH_AON_TOUCH_PAD10_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD10_TH1_S  16

/** TOUCH_AON_PAD10_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD10_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xc8)
/** TOUCH_AON_TOUCH_PAD10_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD10_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD10_TH2_M  (TOUCH_AON_TOUCH_PAD10_TH2_V << TOUCH_AON_TOUCH_PAD10_TH2_S)
#define TOUCH_AON_TOUCH_PAD10_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD10_TH2_S  16

/** TOUCH_AON_PAD11_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD11_TH0_REG (DR_REG_TOUCH_AON_BASE + 0xcc)
/** TOUCH_AON_TOUCH_PAD11_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD11_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD11_TH0_M  (TOUCH_AON_TOUCH_PAD11_TH0_V << TOUCH_AON_TOUCH_PAD11_TH0_S)
#define TOUCH_AON_TOUCH_PAD11_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD11_TH0_S  16

/** TOUCH_AON_PAD11_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD11_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xd0)
/** TOUCH_AON_TOUCH_PAD11_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD11_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD11_TH1_M  (TOUCH_AON_TOUCH_PAD11_TH1_V << TOUCH_AON_TOUCH_PAD11_TH1_S)
#define TOUCH_AON_TOUCH_PAD11_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD11_TH1_S  16

/** TOUCH_AON_PAD11_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD11_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xd4)
/** TOUCH_AON_TOUCH_PAD11_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD11_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD11_TH2_M  (TOUCH_AON_TOUCH_PAD11_TH2_V << TOUCH_AON_TOUCH_PAD11_TH2_S)
#define TOUCH_AON_TOUCH_PAD11_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD11_TH2_S  16

/** TOUCH_AON_PAD12_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD12_TH0_REG (DR_REG_TOUCH_AON_BASE + 0xd8)
/** TOUCH_AON_TOUCH_PAD12_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD12_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD12_TH0_M  (TOUCH_AON_TOUCH_PAD12_TH0_V << TOUCH_AON_TOUCH_PAD12_TH0_S)
#define TOUCH_AON_TOUCH_PAD12_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD12_TH0_S  16

/** TOUCH_AON_PAD12_TH1_REG register
 *  need_des
 */
#define TOUCH_AON_PAD12_TH1_REG (DR_REG_TOUCH_AON_BASE + 0xdc)
/** TOUCH_AON_TOUCH_PAD12_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD12_TH1    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD12_TH1_M  (TOUCH_AON_TOUCH_PAD12_TH1_V << TOUCH_AON_TOUCH_PAD12_TH1_S)
#define TOUCH_AON_TOUCH_PAD12_TH1_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD12_TH1_S  16

/** TOUCH_AON_PAD12_TH2_REG register
 *  need_des
 */
#define TOUCH_AON_PAD12_TH2_REG (DR_REG_TOUCH_AON_BASE + 0xe0)
/** TOUCH_AON_TOUCH_PAD12_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD12_TH2    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD12_TH2_M  (TOUCH_AON_TOUCH_PAD12_TH2_V << TOUCH_AON_TOUCH_PAD12_TH2_S)
#define TOUCH_AON_TOUCH_PAD12_TH2_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD12_TH2_S  16

/** TOUCH_AON_PAD13_TH0_REG register
 *  need_des
 */
#define TOUCH_AON_PAD13_TH0_REG (DR_REG_TOUCH_AON_BASE + 0xe4)
/** TOUCH_AON_TOUCH_PAD13_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define TOUCH_AON_TOUCH_PAD13_TH0    0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD13_TH0_M  (TOUCH_AON_TOUCH_PAD13_TH0_V << TOUCH_AON_TOUCH_PAD13_TH0_S)
#define TOUCH_AON_TOUCH_PAD13_TH0_V  0x0000FFFFU
#define TOUCH_AON_TOUCH_PAD13_TH0_S  16

